_site/lib/tasks/cleanup_tags.rake

  task cleanup_tags: :environment do
    Bookmark.find_each do |bookmark|
      if bookmark.tags.present?
        # 現在のタグを取得
        current_tags = bookmark.tags

        # タグをクリーンアップ
        cleaned_tags = current_tags.map do |tag|
          if tag.is_a?(String)
            # 引用符や括弧を削除
            tag.gsub(/^\[|\]$/, '').gsub(/^"|"$/, '').gsub(/\\"/, '"').strip
          else
            tag.to_s
          end
        end.reject(&:empty?).uniq

        # クリーンアップされたタグが異なる場合のみ更新
        if cleaned_tags != current_tags
          bookmark.update_column(:tags, cleaned_tags)
---
SELECT "bookmarks".* FROM "bookmarks" ORDER BY "bookmarks"."id" ASC LIMIT 1000
UPDATE "bookmarks" SET "tags" = '{test,"\"alphabet"}' WHERE "bookmarks"."id" = 1