app/controllers/bookmarks_controller.rb

  def index
    @bookmarks = current_user.bookmarks.order(created_at: :desc)

    # タグによるフィルタリング
    if params[:tag].present?
      @bookmarks = @bookmarks.with_tag(params[:tag])
    end

    # タグの一覧を取得（タグクラウド用）
    @tags = current_user.bookmarks.flat_map(&:tags).uniq

    # タグの使用回数を集計
    @tag_counts = {}
    current_user.bookmarks.each do |bookmark|
      bookmark.tags.each do |tag|
        @tag_counts[tag] ||= 0
        @tag_counts[tag] += 1
      end
    end

    # タグのソート
    case params[:sort]
    when 'count_desc'
      @tags = @tags.sort_by { |tag| [-@tag_counts[tag], tag] }
    when 'count_asc'
      @tags = @tags.sort_by { |tag| [@tag_counts[tag], tag] }
    when 'created_desc'
      @tags = @tags.sort_by { |tag| [-current_user.bookmarks.where("? = ANY(tags)", tag).maximum(:created_at).to_i, tag] }
    when 'created_asc'
      @tags = @tags.sort_by { |tag| [current_user.bookmarks.where("? = ANY(tags)", tag).minimum(:created_at).to_i, tag] }
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1 AND (string_to_array(tags, ',') @> ARRAY['alphabet']::text[]) ORDER BY "bookmarks"."created_at" DESC
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1 ORDER BY "bookmarks"."created_at" DESC
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1

  def create
    @bookmark = current_user.bookmarks.build(bookmark_params)

    # 同じURLのブックマークが既に存在するか確認
    existing_bookmark = current_user.bookmarks.find_by(url: @bookmark.url)

    respond_to do |format|
      if existing_bookmark
        # 既存のブックマークが見つかった場合
        format.html {
          flash[:alert] = "このURLは既にブックマークに登録されています。"
          redirect_to edit_bookmark_path(existing_bookmark)
        }
        format.json { render json: { status: 'error', message: 'このURLは既に登録されています', existing_bookmark: existing_bookmark }, status: :unprocessable_entity }
      elsif @bookmark.save
        @bookmark.generate_description
        format.html { redirect_to bookmarks_path, notice: "ブックマークを追加しました。" }
        format.json { render json: { status: 'success', bookmark: @bookmark }, status: :created }
        format.turbo_stream
      else
        # エラーメッセージをログに出力
        Rails.logger.error("Bookmark save error: #{@bookmark.errors.full_messages.join(', ')}")

        # 新規作成フォームを表示
        @tags = Tag.all
        format.html {
          flash.now[:alert] = @bookmark.errors.full_messages.join(', ')
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1 AND "bookmarks"."url" = 'https://deepmind.google/' LIMIT 1
INSERT INTO "bookmarks" ("title", "url", "description", "tags", "user_id", "created_at", "updated_at", "ai_processing_status", "ai_processed_at") VALUES ('deepmind', 'https://deepmind.google/', NULL, '["alphabet"]', 1, '2025-02-27 03:40:06.804698', '2025-02-27 03:40:06.804698', 0, NULL) RETURNING "id"
UPDATE "bookmarks" SET "title" = 'x.com', "url" = 'https://x.com/home', "tags" = '["x", "sns"]', "updated_at" = '2025-02-27 02:15:08.431837' WHERE "bookmarks"."id" = 2
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1 AND "bookmarks"."id" = 1 LIMIT 1

  def update
    respond_to do |format|
      if @bookmark.update(bookmark_params)
---
UPDATE "bookmarks" SET "tags" = '["google"]', "updated_at" = '2025-02-27 04:11:01.126504' WHERE "bookmarks"."id" = 3

  def destroy
    @bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = 4

  def check_exists
    url = params[:url]
    Rails.logger.info("Checking if URL exists: #{url}")

    if url.blank?
      Rails.logger.warn("URL parameter is blank")
      return render json: { error: "URL is required" }, status: :bad_request
    end

    # 認証チェックを緩和（拡張機能からのリクエスト用）
    if current_user.nil?
      Rails.logger.warn("User not authenticated")
      return render json: { error: "Authentication required", requires_login: true }, status: :unauthorized
    end

    begin
      exists = current_user.bookmarks.exists?(url: url)
---
SELECT 1 AS one FROM "bookmarks" WHERE "bookmarks"."url" = 'https://deepmind.google/' AND "bookmarks"."id" != 3 AND "bookmarks"."user_id" = 1 LIMIT 1
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1 AND "bookmarks"."id" = 3 LIMIT 1

  def save_from_extension
    # 認証チェック
    unless current_user
      return render json: { error: "Authentication required" }, status: :unauthorized
    end

    @bookmark = current_user.bookmarks.build(bookmark_params)

    if @bookmark.save
      render json: {
        status: 'success',
        message: 'ブックマークを保存しました',
        bookmark: @bookmark
      }, status: :created
    else
      render json: {
        status: 'error',
        message: @bookmark.errors.full_messages.join(', '),
        errors: @bookmark.errors.full_messages
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1 AND "bookmarks"."id" = 3 LIMIT 1

  def set_bookmark
    @bookmark = current_user.bookmarks.find(params[:id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1 AND "bookmarks"."id" = 4 LIMIT 1