app/controllers/bookmarks_controller.rb

  def destroy
    @bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = 4

  def set_bookmark
    @bookmark = current_user.bookmarks.find(params[:id])
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = 1 AND "bookmarks"."id" = 1 LIMIT 1